MESSAGES = {
    "connected": "\nУстройство подключено.",
    "connection_failed": "Не удалось подключиться к устройству. Повторная попытка...",
    "scan_barcode": "\nОтсканируйте штрих-код: ",
    "empty_barcode": "\nОшибка: штрих-код не введён. Повторите попытку.",
    "invalid_barcode": "Ошибка: штрих-код должен содержать только цифры и быть длиной {} символов.",
    "success": "Штрих-код передан на плату сопряжения.",
    "cancel_barcode": "Отправка штрих-кода отменена.\n",
    "incorrect_input": "Неверный ввод. Повторите попытку."
}

SCANNER_CONFIG = {
    "baudrate": 9600,
    "timeout": 1,
    "max_length_code": 9,
}
